Revit 2024 API
Document.NewFlexDuct Method
Adds a new flexible duct into the document.
Overload List
Name | Description
NewFlexDuct(IList<XYZ>, FlexDuctType)
Adds a new flexible duct into the document, using a point array and duct type.
NewFlexDuct(Connector, Connector, FlexDuctType)
Adds a new flexible duct into the document, using two connector, and duct type.
NewFlexDuct(Connector, IList<XYZ>, FlexDuctType)
Adds a new flexible duct into the document, using a connector, point array and duct type.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace